//Задача 1: Пользователь вводит с клавиатуры M чисел. Посчитайте, сколько чисел больше 0 ввёл пользователь.
Console.Write("Введите числа через пробел: ");
string array = Console.ReadLine()!;
Console.Write(array);





//void Counter(int[] arr)
//{
 //   int c = 0;
 //   for (int i = 0; i < arr.Length; i++)
  //  {
 ///       if(arr[i] > 0) c++;
  //  }
  //  Console.WriteLine($"The number of elements > 0 is {c}");
//}

//Counter(array);